carbonly/app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    if params[:search].present?
      @cars = Car.search params[:search]