carbonly/app/controllers/trips_controller.rb

INSERT INTO "trips" ("origin", "destination", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["origin", "bondi"], ["destination", "sydney"], ["user_id", 1], ["created_at", "2015-01-15 03:55:29.045494"], ["updated_at", "2015-01-15 03:55:29.045494"]]
---
  def create
    @trip = Trip.new trip_params
    @trip.user_id = current_user.id
    if @trip.save

UPDATE "trips" SET "origin" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["origin", "bondi "], ["updated_at", "2015-01-14 00:32:07.788368"], ["id", 4]]
---
  def update
    if @trip.update trip_params

DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 2]]
---
  def destroy
    @trip.destroy

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 4]]
---
  def find_trip
    @trip = Trip.find params[:id]